def solution(letter):
    answer = ''
    morse = { 
    '.-':'a','-...':'b','-.-.':'c','-..':'d','.':'e','..-.':'f',
    '--.':'g','....':'h','..':'i','.---':'j','-.-':'k','.-..':'l',
    '--':'m','-.':'n','---':'o','.--.':'p','--.-':'q','.-.':'r',
    '...':'s','-':'t','..-':'u','...-':'v','.--':'w','-..-':'x',
    '-.--':'y','--..':'z'
    }
    letter = letter.split()
    decode_letter = [morse[code] for code in letter]
    answer = ''.join(decode_letter)
    return answer

solution(".... . .-.. .-.. ---")


"""
다른사람코드
    def solution(letter):
        morse = {
            '.-':'a','-...':'b','-.-.':'c','-..':'d','.':'e','..-.':'f',
            '--.':'g','....':'h','..':'i','.---':'j','-.-':'k','.-..':'l',
            '--':'m','-.':'n','---':'o','.--.':'p','--.-':'q','.-.':'r',
            '...':'s','-':'t','..-':'u','...-':'v','.--':'w','-..-':'x',
            '-.--':'y','--..':'z'
        }

        return ''.join([morse[i] for i in letter.split(' ')])
"""